In [1]:
import pandas as pd

In [2]:
pd.__version__

'0.25.3'

In [3]:
titanic = pd.read_csv('http://bit.ly/pandastrick1')

In [5]:
titanic.groupby('Pclass').Age.agg(['mean','max'])

             mean   max
Pclass
1       38.233441  80.0
2       29.877630  70.0
3       25.140620  74.0

In [6]:
titanic.groupby('Pclass').agg({'Age':['mean','max']})

              Age
             mean   max
Pclass
1       38.233441  80.0
2       29.877630  70.0
3       25.140620  74.0

In [7]:
titanic.groupby('Pclass').Age.agg(mean_age = 'mean', max_age='max')

         mean_age  max_age
Pclass
1       38.233441     80.0
2       29.877630     70.0
3       25.140620     74.0